{
  "lessons": [
    {
      "id": "tenses-basic",
      "title": "Temel Zamanlar: Present, Past, Future",
      "level": "intermediate",
      "estimatedTime": 45,
      "sections": [
        {
          "heading": "Giriş",
          "content": "YDS sınavında zaman uyumu ve doğru tense kullanımı kritik öneme sahiptir. Bu ders, Simple Present, Simple Past ve Simple Future zamanlarının akademik metinlerde nasıl kullanıldığını detaylı şekilde ele almaktadır. YDS'de özellikle bilimsel metinlerde genel gerçekler için Simple Present, araştırma sonuçları için Simple Past, ve gelecek projeksiyonlar için Future tense sıkça karşınıza çıkar."
        },
        {
          "heading": "Simple Present Tense",
          "content": "Simple Present, genel gerçekleri, alışkanlıkları, bilimsel hakikatleri ve değişmeyen durumları ifade eder. YDS'de özellikle:\n\n1. **Bilimsel Gerçekler**: Water boils at 100 degrees Celsius. (Su 100 derecede kaynar.)\n2. **Genel Hakikatler**: The Earth revolves around the Sun. (Dünya Güneş'in etrafında döner.)\n3. **Düzenli Olaylar**: The conference takes place annually. (Konferans her yıl gerçekleşir.)\n\n**Yapı**:\n- Olumlu: Subject + Verb (s/es ile 3. tekil şahıs)\n- Olumsuz: Subject + do/does not + Verb\n- Soru: Do/Does + Subject + Verb?\n\n**Akademik Kullanım**:\n'This study examines...' (Bu çalışma inceler...)\n'Research indicates that...' (Araştırmalar gösterir ki...)\n'The data suggests...' (Veri önerir ki...)"
        },
        {
          "heading": "Simple Past Tense",
          "content": "Simple Past, geçmişte tamamlanmış eylemleri anlatır. YDS'de özellikle:\n\n1. **Araştırma Metodolojisi**: The researchers conducted a survey. (Araştırmacılar bir anket yaptılar.)\n2. **Tarihsel Olaylar**: Darwin published his theory in 1859. (Darwin teorisini 1859'da yayımladı.)\n3. **Tamamlanmış Çalışmalar**: The study investigated the effects of... (Çalışma ... etkilerini araştırdı.)\n\n**Yapı**:\n- Düzenli fiiller: Subject + Verb + ed\n- Düzensiz fiiller: Subject + V2 (ikinci hali)\n- Olumsuz: Subject + did not + Verb\n- Soru: Did + Subject + Verb?\n\n**YDS İpucu**: Methods bölümlerinde genellikle Simple Past kullanılır:\n'We collected data from 500 participants.' (500 katılımcıdan veri topladık.)\n'The experiment lasted six months.' (Deney altı ay sürdü.)"
        },
        {
          "heading": "Simple Future Tense",
          "content": "Simple Future, gelecekteki olayları, tahminleri ve niyetleri ifade eder. YDS'de:\n\n1. **Tahminler**: Climate change will affect millions. (İklim değişikliği milyonları etkileyecek.)\n2. **Gelecek Projeler**: Further research will explore... (İleri araştırma keşfedecek...)\n3. **Olası Sonuçlar**: This approach will likely improve outcomes. (Bu yaklaşım muhtemelen sonuçları iyileştirecek.)\n\n**Yapı**:\n- Will: Subject + will + Verb\n- Going to: Subject + am/is/are + going to + Verb\n\n**Fark**:\n- **Will**: Ani kararlar, tahminler, vaatler\n- **Going to**: Planlar, niyetler, kanıta dayalı tahminler\n\n**Akademik Örnek**:\n'The findings will contribute to...' (Bulgular katkıda bulunacak...)\n'We are going to examine...' (İnceleyeceğiz...)"
        },
        {
          "heading": "Yaygın Hatalar ve Çözümleri",
          "content": "**1. Zaman Karışıklığı**\n❌ Yesterday, the study shows results. (Dün, çalışma sonuçları gösteriyor.)\n✅ Yesterday, the study showed results. (Dün, çalışma sonuçları gösterdi.)\n\n**2. 3. Tekil Şahıs -s/-es Unutulması**\n❌ The researcher analyze data. (Araştırmacı veri analiz eder.)\n✅ The researcher analyzes data. (Araştırmacı veri analiz eder.)\n\n**3. Did ile Fiil Çekimi**\n❌ Did she conducted the experiment? (O deneyi yaptı mı?)\n✅ Did she conduct the experiment? (O deneyi yaptı mı?)\n\n**4. Will ile -ing Kullanımı**\n❌ They will be conduct research. (Araştırma yapacaklar.)\n✅ They will conduct research. (Araştırma yapacaklar.)\n\n**5. Genel Gerçeklerde Past Kullanımı**\n❌ Water boiled at 100°C. (Su 100°C'de kaynadı.)\n✅ Water boils at 100°C. (Su 100°C'de kaynar.)"
        },
        {
          "heading": "YDS Sınav Stratejileri",
          "content": "1. **Zaman Belirteçlerine Dikkat**: always, usually (Present); yesterday, last year (Past); tomorrow, next week (Future)\n\n2. **Cümle Bağlamını Okuyun**: Önceki ve sonraki cümlelerin zamanına bakın.\n\n3. **Bilimsel Metinlerde**: Introduction/Discussion (Present), Methods/Results (Past), Future Work (Future)\n\n4. **If-clause'lara Dikkat**: If + Present Simple, will + Verb (Type 1 Conditional)\n\n5. **Pasif Yapılarda**: is/are + V3 (Present), was/were + V3 (Past), will be + V3 (Future)"
        },
        {
          "heading": "Pratik Alıştırma İpuçları",
          "content": "1. **Akademik makalelerin abstract bölümlerini okuyun** - Hangi tense'lerin nerede kullanıldığını gözlemleyin.\n\n2. **Zaman çizelgesi oluşturun** - Olayları timeline üzerinde görseleştirin.\n\n3. **Boşluk doldurma** - YDS tipi metinlerde tense seçimi yapın.\n\n4. **Hatalı cümleleri düzeltin** - Tense hatalarını bulma pratiği yapın.\n\n5. **Kendi cümlelerinizi yazın** - Her tense için akademik bağlamda 5 cümle oluşturun."
        }
      ]
    },
    {
      "id": "perfect-tenses",
      "title": "Perfect Tenses: Present Perfect, Past Perfect, Future Perfect",
      "level": "advanced",
      "estimatedTime": 50,
      "sections": [
        {
          "heading": "Perfect Tenses'in Önemi",
          "content": "Perfect tenses, YDS'nin en zorlu konularından biridir çünkü Türkçe'de doğrudan karşılıkları yoktur. Bu zamanlar, eylemler arasındaki zaman ilişkisini ve bir eylemin tamamlanma durumunu gösterir. YDS'de özellikle:\n\n- Araştırma sonuçlarını günümüze bağlama\n- Geçmişteki iki olay arasındaki öncelik ilişkisi\n- Gelecekte tamamlanacak eylemlerin ifadesi\n\nBu tense'ler akademik yazımda sofistike bir zaman kavrayışı gösterir ve YDS'de sıkça test edilir."
        },
        {
          "heading": "Present Perfect Tense",
          "content": "Present Perfect, geçmişte başlayıp şimdiye kadar devam eden veya şimdi tamamlanmış ama etkisi hala devam eden eylemleri gösterir.\n\n**Yapı**: Subject + have/has + V3 (past participle)\n\n**Kullanım Alanları**:\n\n1. **Belirtisiz Geçmiş Zaman**:\nResearchers have identified several factors. (Araştırmacılar birkaç faktör belirledi.) [Ne zaman belirlendi bilmiyoruz, ama sonuç önemli]\n\n2. **Şimdiye Kadar Yapılan Deneyimler**:\nThis method has proven effective in multiple studies. (Bu yöntem birçok çalışmada etkili olduğunu kanıtladı.)\n\n3. **Henüz Tamamlanmamış Zaman Dilimi**:\nScientists have made significant progress this year. (Bilim insanları bu yıl önemli ilerleme kaydetti.) [Yıl henüz bitmedi]\n\n4. **Just, Already, Yet ile**:\n- The results have just been published. (Sonuçlar yeni yayımlandı.)\n- They have already completed the analysis. (Analizi zaten tamamladılar.)\n- Have they submitted the paper yet? (Makaleyi henüz gönderdiler mi?)\n\n**YDS'de Sık Kullanım**:\n'Recent studies have shown that...' (Son çalışmalar gösterdi ki...)\n'This approach has gained popularity...' (Bu yaklaşım popülerlik kazandı...)\n'Researchers have long debated...' (Araştırmacılar uzun süredir tartışıyor...)"
        },
        {
          "heading": "Present Perfect vs Simple Past",
          "content": "Bu ayrım YDS'de çok sık test edilir!\n\n**Present Perfect** (Zaman belirtilmemiş, sonuç önemli):\n✅ Darwin has influenced modern biology. (Darwin modern biyolojiyi etkiledi.) [Etki hala devam ediyor]\n✅ Studies have confirmed this hypothesis. (Çalışmalar bu hipotezi doğruladı.) [Hangi çalışmalar, ne zaman önemli değil]\n\n**Simple Past** (Belirli zaman, tamamlanmış eylem):\n✅ Darwin published his theory in 1859. (Darwin teorisini 1859'da yayımladı.) [Belirli zaman]\n✅ The study confirmed this hypothesis in 2020. (Çalışma bu hipotezi 2020'de doğruladı.) [Belirli zaman]\n\n**Hatalı Kullanım**:\n❌ Recent studies showed... (Son çalışmalar gösterdi...) → 'recent' ile Perfect kullanılmalı\n✅ Recent studies have shown... (Son çalışmalar gösterdi...)\n\n❌ Darwin has published his theory in 1859. → Belirli zaman ile Perfect kullanılamaz\n✅ Darwin published his theory in 1859."
        },
        {
          "heading": "Past Perfect Tense",
          "content": "Past Perfect, geçmişteki iki olaydan daha öncekini gösterir. 'Geçmişin geçmişi' olarak düşünülebilir.\n\n**Yapı**: Subject + had + V3\n\n**Kullanım**:\n\n1. **Öncelik İlişkisi**:\nBy the time the researchers arrived, the experiment had already ended. (Araştırmacılar vardığında, deney zaten bitmişti.)\n[Önce deney bitti → Sonra araştırmacılar geldi]\n\n2. **Raporlanan Geçmiş**:\nThe study reported that previous research had overlooked this factor. (Çalışma, önceki araştırmanın bu faktörü gözden kaçırdığını bildirdi.)\n\n3. **Neden-Sonuç İlişkisi**:\nThe plant died because it had not received enough water. (Bitki öldü çünkü yeterli su almamıştı.)\n\n**Zaman Belirteçleri**:\n- before, after, by the time, until, when\n- already, just, never, ever (Past Perfect ile)\n\n**YDS Örneği**:\n'Scientists discovered that the species had adapted to climate change long before human intervention.' (Bilim insanları, türün insan müdahalesinden çok önce iklim değişikliğine uyum sağladığını keşfetti.)"
        },
        {
          "heading": "Future Perfect Tense",
          "content": "Future Perfect, gelecekte belirli bir zamana kadar tamamlanacak eylemleri gösterir.\n\n**Yapı**: Subject + will have + V3\n\n**Kullanım**:\n\n1. **Gelecekte Tamamlanacak Eylemler**:\nBy 2030, scientists will have discovered a cure. (2030'a kadar, bilim insanları bir tedavi bulmuş olacak.)\n\n2. **Tahmin ve Projeksiyon**:\nThe temperature will have risen by 2 degrees by the end of the century. (Sıcaklık yüzyılın sonuna kadar 2 derece yükselmiş olacak.)\n\n3. **Akademik Planlama**:\nBy the time we publish, other researchers will have addressed this issue. (Yayımladığımızda, diğer araştırmacılar bu konuyu ele almış olacak.)\n\n**Zaman Belirteçleri**:\n- by (by 2025, by next week, by the time)\n- before (before the conference, before the deadline)\n\n**YDS'de Kullanım**:\n'By the next decade, this technology will have transformed the industry.' (Önümüzdeki on yılda, bu teknoloji endüstriyi dönüştürmüş olacak.)"
        },
        {
          "heading": "Yaygın Hatalar",
          "content": "**1. Have/Has ile Did Karıştırılması**\n❌ Have you finished the experiment yesterday? (Deneyi dün bitirdiniz mi?)\n✅ Did you finish the experiment yesterday? (Deneyi dün bitirdiniz mi?)\n\n**2. Past Perfect Gereksiz Kullanımı**\n❌ After the study had ended, we had analyzed the data. (Çalışma bittikten sonra, veriyi analiz ettik.)\n✅ After the study ended, we analyzed the data. (İki eylem sıralı ise Past Perfect gereksiz)\n\nAMA:\n✅ We analyzed the data that the study had collected. (Çalışmanın topladığı veriyi analiz ettik.) [Önce toplama, sonra analiz]\n\n**3. Zaman Belirteçleri ile Yanlış Tense**\n❌ In 2020, researchers have found... (2020'de, araştırmacılar buldu...)\n✅ In 2020, researchers found... (Belirli zaman → Simple Past)\n\n**4. Future Perfect'te 'Will' Tekrarı**\n❌ By 2025, they will will have completed... (2025'e kadar tamamlamış olacaklar...)\n✅ By 2025, they will have completed... (2025'e kadar tamamlamış olacaklar...)\n\n**5. Present Perfect Continuous ile Karıştırma**\n✅ Researchers have studied this topic. (Araştırmacılar bu konuyu çalıştı.) [Tamamlanmış]\n✅ Researchers have been studying this topic. (Araştırmacılar bu konuyu çalışıyor.) [Devam ediyor]"
        },
        {
          "heading": "Sınav Stratejileri",
          "content": "1. **Zaman Çizelgesi Çizin**: İki veya daha fazla eylem varsa, hangisinin önce olduğunu belirleyin.\n\n2. **Zaman Belirteçlerine Odaklanın**:\n   - Belirli zaman (1859, last year) → Simple Past\n   - Belirsiz zaman (recently, so far) → Present Perfect\n   - By + gelecek zaman → Future Perfect\n\n3. **Sonuç Odaklı mı?**: Eğer geçmiş eylem şimdiki durumu etkiliyorsa → Present Perfect\n\n4. **Before/After Yapıları**: Genellikle bir cümlede Past Perfect, diğerinde Simple Past\n\n5. **Akademik Metin Yapısı**:\n   - Literature Review: Present Perfect (Studies have shown...)\n   - Methods: Simple Past (We collected...)\n   - Discussion: Karışık (Present findings + Past Perfect for earlier studies)"
        }
      ]
    },
    {
      "id": "conditionals",
      "title": "Conditionals: Koşul Cümleleri (Types 0, 1, 2, 3, Mixed)",
      "level": "advanced",
      "estimatedTime": 55,
      "sections": [
        {
          "heading": "Conditional Cümlelerinin Temelleri",
          "content": "Conditional (koşul) cümleleri, bir durumun gerçekleşmesi halinde ne olacağını ifade eder. YDS'de conditionals özellikle:\n\n- Bilimsel hipotezler\n- Neden-sonuç ilişkileri\n- Varsayımsal durumlar\n- Araştırma önerileri\n\nkonularında sıkça kullanılır. Conditional cümleleri iki bölümden oluşur:\n\n1. **If-clause (koşul)**: Koşulu belirtir\n2. **Main clause (sonuç)**: Koşul gerçekleşirse ne olacağını gösterir\n\n**Yapı Esnekliği**:\n- If + condition, result. (If it rains, the experiment will stop.)\n- Result + if + condition. (The experiment will stop if it rains.)\n\nVirgül kullanımı: If-clause önce gelirse virgül kullanılır."
        },
        {
          "heading": "Type 0 Conditional: Genel Gerçekler ve Bilimsel Hakikatler",
          "content": "Type 0, her zaman doğru olan genel gerçekleri ve bilimsel yasaları ifade eder.\n\n**Yapı**: If + Present Simple, Present Simple\n\n**Kullanım Alanları**:\n\n1. **Bilimsel Yasalar**:\nIf you heat water to 100°C, it boils. (Suyu 100°C'ye ısıtırsanız, kaynar.)\nIf plants don't receive sunlight, they die. (Bitkiler güneş ışığı almazsa, ölürler.)\n\n2. **Genel Gerçekler**:\nIf demand increases, prices rise. (Talep artarsa, fiyatlar yükselir.)\nIf the temperature drops below zero, water freezes. (Sıcaklık sıfırın altına düşerse, su donar.)\n\n3. **Prosedürler ve Talimatlar**:\nIf the solution turns blue, add more acid. (Çözelti maviye dönerse, daha fazla asit ekleyin.)\nIf the error persists, restart the system. (Hata devam ederse, sistemi yeniden başlatın.)\n\n**YDS İpucu**: Type 0'da 'if' yerine 'when', 'whenever', 'as soon as' de kullanılabilir:\n'When water reaches 100°C, it boils.' (Su 100°C'ye ulaştığında, kaynar.)\n\n**Akademik Örnek**:\n'If researchers control for confounding variables, they obtain more reliable results.' (Araştırmacılar karıştırıcı değişkenleri kontrol ederlerse, daha güvenilir sonuçlar elde ederler.)"
        },
        {
          "heading": "Type 1 Conditional: Gerçek Gelecek Olasılıkları",
          "content": "Type 1, gelecekte gerçekleşmesi muhtemel durumları ve sonuçlarını ifade eder.\n\n**Yapı**: If + Present Simple, will + Verb\n\n**Kullanım Alanları**:\n\n1. **Gelecek Tahminler**:\nIf climate change continues, sea levels will rise. (İklim değişikliği devam ederse, deniz seviyeleri yükselecek.)\nIf we increase the sample size, the results will be more accurate. (Örneklem büyüklüğünü artırırsak, sonuçlar daha doğru olacak.)\n\n2. **Araştırma Planları**:\nIf the hypothesis is correct, further research will confirm it. (Hipotez doğruysa, ileri araştırma bunu doğrulayacak.)\nIf funding is approved, the project will begin next year. (Fon onaylanırsa, proje gelecek yıl başlayacak.)\n\n3. **Uyarılar ve Öneriler**:\nIf you don't control the variables, you will get invalid results. (Değişkenleri kontrol etmezseniz, geçersiz sonuçlar alacaksınız.)\nIf we don't act now, the situation will worsen. (Şimdi hareket etmezsek, durum kötüleşecek.)\n\n**Modallar ile Type 1**:\n- If + Present, may/might/can/could + Verb\n\nIf the data is accurate, this approach may revolutionize treatment. (Veri doğruysa, bu yaklaşım tedavide devrim yapabilir.)\nIf we adjust the parameters, we could achieve better outcomes. (Parametreleri ayarlarsak, daha iyi sonuçlar elde edebiliriz.)\n\n**YDS'de Sık Görülen**:\n'If current trends persist, the problem will escalate.' (Mevcut eğilimler devam ederse, sorun artacak.)\n'If researchers adopt this method, they will observe significant improvements.' (Araştırmacılar bu yöntemi benimserse, önemli gelişmeler gözlemleyecekler.)"
        },
        {
          "heading": "Type 2 Conditional: Hayali Şimdiki Zaman Durumları",
          "content": "Type 2, şu anda gerçek olmayan veya gerçekleşme olasılığı çok düşük durumları ifade eder.\n\n**Yapı**: If + Past Simple, would/could/might + Verb\n\n**Önemli**: Past Simple kullanılsa da, anlam 'şimdi' ile ilgilidir!\n\n**Kullanım Alanları**:\n\n1. **Varsayımsal Durumlar**:\nIf we had unlimited funding, we would conduct more extensive research. (Sınırsız fonumuz olsaydı, daha kapsamlı araştırma yapardık.) [Ama yok]\nIf climate change were reversible, we would see immediate action. (İklim değişikliği geri dönüşümlü olsaydı, hemen eylem görürdük.) [Ama değil]\n\n2. **Öneriler ve Eleştiriler**:\nIf policymakers understood the data, they would implement better regulations. (Politika yapıcılar veriyi anlasaydı, daha iyi düzenlemeler uygularlardı.) [Ama anlamıyorlar]\nIf researchers used this methodology, they would obtain more reliable results. (Araştırmacılar bu metodolojiyi kullansaydı, daha güvenilir sonuçlar elde ederlerdi.) [Ama kullanmıyorlar]\n\n3. **Kibarlık ve İncelik**:\nIt would be beneficial if institutions invested more in research. (Kurumlar araştırmaya daha fazla yatırım yapsaydı faydalı olurdu.)\nIf we could access that database, our analysis would be more comprehensive. (O veritabanına erişebilseydik, analizimiz daha kapsamlı olurdu.)\n\n**'Were' Kullanımı**:\nType 2'de 'to be' fiili için tüm şahıslarda 'were' kullanılır (formal):\n✅ If I were a researcher... (Araştırmacı olsaydım...)\n✅ If the hypothesis were true... (Hipotez doğru olsaydı...)\n\n**YDS Örneği**:\n'If governments prioritized education, literacy rates would improve significantly.' (Hükümetler eğitime öncelik verseydi, okur-yazarlık oranları önemli ölçüde artardı.)"
        },
        {
          "heading": "Type 3 Conditional: Geçmiş Pişmanlıklar ve Hayali Durumlar",
          "content": "Type 3, geçmişte gerçekleşmemiş durumları ve olası sonuçlarını ifade eder. Değiştirilemez durumlar için kullanılır.\n\n**Yapı**: If + Past Perfect, would/could/might + have + V3\n\n**Kullanım Alanları**:\n\n1. **Geçmiş Eleştiriler**:\nIf researchers had controlled for bias, the results would have been more valid. (Araştırmacılar önyargıyı kontrol etseydi, sonuçlar daha geçerli olurdu.) [Ama kontrol etmediler]\nIf the study had included a larger sample, it would have been more reliable. (Çalışma daha büyük örneklem içerseydi, daha güvenilir olurdu.) [Ama içermedi]\n\n2. **Alternatif Senaryolar**:\nIf scientists had discovered antibiotics earlier, millions of lives would have been saved. (Bilim insanları antibiyotikleri daha erken keşfetseydi, milyonlarca hayat kurtarılırdı.)\nIf the experiment had been conducted differently, the outcome might have changed. (Deney farklı yürütülseydi, sonuç değişebilirdi.)\n\n3. **Neden-Sonuç Analizi**:\nThe species would not have become extinct if habitat destruction had been prevented. (Habitat yıkımı önlenseydi, tür yok olmazdı.)\nIf early warnings had been heeded, the disaster could have been avoided. (Erken uyarılar dikkate alınsaydı, felaket önlenebilirdi.)\n\n**Modallar ile Nüanslar**:\n- **would have**: Kesin sonuç\n- **could have**: Olası sonuç\n- **might have**: Daha az kesin olasılık\n\n**YDS'de Kullanım**:\n'If policymakers had acted on the research, the current crisis could have been prevented.' (Politika yapıcılar araştırmaya göre hareket etseydi, mevcut kriz önlenebilirdi.)"
        },
        {
          "heading": "Mixed Conditionals: Karma Koşul Cümleleri",
          "content": "Mixed conditionals, farklı zaman dilimlerini birleştirir. YDS'de ileri seviye bir yapıdır.\n\n**Type 1: Past → Present**\n**Yapı**: If + Past Perfect, would/could/might + Verb\n\n**Kullanım**: Geçmişteki bir durum şimdiki sonucu etkiliyor.\n\nIf Darwin had not published his theory, modern biology would be very different. (Darwin teorisini yayımlamamış olsaydı, modern biyoloji çok farklı olurdu.)\n[Geçmiş eylem → Şimdiki durum]\n\nIf researchers had adopted this method earlier, we would have better data now. (Araştırmacılar bu yöntemi daha erken benimseseydi, şimdi daha iyi verimiz olurdu.)\n\n**Type 2: Present → Past**\n**Yapı**: If + Past Simple, would/could/might + have + V3\n\n**Kullanım**: Şimdiki bir durum geçmişteki bir sonucu etkiliyor.\n\nIf the researchers were more careful, the error would not have occurred. (Araştırmacılar daha dikkatli olsaydı, hata meydana gelmezdi.)\n[Şimdiki özellik → Geçmiş sonuç]\n\nIf climate change were not a threat, previous species extinctions would not have happened. (İklim değişikliği tehdit olmasaydı, önceki türlerin yok olması olmazdı.)\n\n**YDS İpucu**: Mixed conditionals akademik metinlerde geçmiş araştırmaların bugünkü etkileri tartışılırken kullanılır."
        },
        {
          "heading": "Yaygın Hatalar ve Çözümleri",
          "content": "**1. Type 1'de Will Kullanımı (If-clause'da)**\n❌ If the study will prove this, we will accept it. (Çalışma bunu kanıtlarsa, kabul edeceğiz.)\n✅ If the study proves this, we will accept it. (If-clause'da 'will' kullanılmaz!)\n\n**2. Type 2'de Would Kullanımı (If-clause'da)**\n❌ If researchers would have funding, they would conduct studies. (Araştırmacıların fonu olsaydı, çalışma yaparlardı.)\n✅ If researchers had funding, they would conduct studies. (If-clause'da 'would' kullanılmaz!)\n\n**3. Type 2 ve Type 3 Karışımı**\n❌ If the data was accurate, the results would have been valid. (Veri doğru olsaydı, sonuçlar geçerli olurdu.)\n✅ Type 2: If the data were accurate, the results would be valid. (Şimdi)\n✅ Type 3: If the data had been accurate, the results would have been valid. (Geçmiş)\n\n**4. Unless ile Olumsuz Karışımı**\n❌ Unless you don't control variables, results will be invalid. (Değişkenleri kontrol etmezseniz...)\n✅ Unless you control variables, results will be invalid. (Unless = if not, zaten olumsuz)\n\n**5. Type 0 ve Type 1 Karışımı**\n❌ If water boils, it will reach 100°C. (Su kaynarsa, 100°C'ye ulaşacak.)\n✅ If water boils, it reaches 100°C. (Genel gerçek → Type 0)\n\n**6. Virgül Hatası**\n❌ The results will be valid if you control the variables. (Sonuçlar geçerli olacak, değişkenleri kontrol ederseniz.)\n✅ The results will be valid if you control the variables. (Main clause önce → virgül yok)\n✅ If you control the variables, the results will be valid. (If-clause önce → virgül var)"
        },
        {
          "heading": "Sınav Stratejileri ve Pratik İpuçları",
          "content": "**1. Gerçeklik Derecesini Belirleyin**:\n- Gerçek/olası → Type 0 veya Type 1\n- Hayali şimdi → Type 2\n- Hayali geçmiş → Type 3\n\n**2. Zaman İpuçlarını Bulun**:\n- 'now', 'currently', 'today' → Type 1 veya Type 2\n- 'in the past', 'last year', 'previously' → Type 3\n- Zaman yok + bilimsel → Type 0\n\n**3. Modal Fiillere Dikkat**:\n- will/shall → Type 1\n- would/could/might (şimdi) → Type 2\n- would/could/might + have + V3 → Type 3\n\n**4. Bağlam Analizi**:\nÖnceki ve sonraki cümleleri okuyun. Akademik metinde:\n- Introduction/Discussion → Type 1 (gelecek projeksiyonlar)\n- Literature Review → Type 3 (geçmiş çalışmaların eleştirisi)\n- Recommendations → Type 2 (öneriler)\n\n**5. Alternatif Yapılar**:\n- 'provided (that)', 'as long as', 'on condition that' → Type 1\n- 'suppose/supposing', 'what if' → Type 2\n- 'were to' → Type 2 (daha formal)\n\n**Pratik Önerileri**:\n1. Her conditional type için 10 akademik cümle yazın\n2. YDS tipi metinlerden conditional cümleleri çıkarıp analiz edin\n3. Hatalı cümleleri düzeltme egzersizleri yapın\n4. Type 2 ve Type 3'ü zaman çizelgesi ile görselleştirin\n5. Mixed conditionals için gerçek akademik makale örnekleri bulun"
        }
      ]
    },
    {
      "id": "passive-voice",
      "title": "Passive Voice: Akademik İngilizce'de Edilgen Yapı",
      "level": "advanced",
      "estimatedTime": 50,
      "sections": [
        {
          "heading": "Passive Voice'un Akademik Önemi",
          "content": "Passive voice (edilgen yapı), YDS'nin en kritik konularından biridir çünkü akademik ve bilimsel yazımda yoğun olarak kullanılır. Passive voice:\n\n**Neden Akademik Metinlerde Sık Kullanılır?**\n\n1. **Nesnellik**: Yapan kişiden çok, yapılan işlem önemlidir.\n   - Active: We conducted the experiment. (Deneyi yaptık.)\n   - Passive: The experiment was conducted. (Deney yapıldı.)\n\n2. **Formalitenin Arttırılması**: Daha resmi ve profesyonel ton.\n   - Active: Researchers found significant results. (Araştırmacılar önemli sonuçlar buldu.)\n   - Passive: Significant results were found. (Önemli sonuçlar bulundu.)\n\n3. **Yapan Bilinmiyor veya Önemsiz**:\n   - The theory was proposed in the 19th century. (Teori 19. yüzyılda öne sürüldü.)\n\n4. **Sonuca Odaklanma**: Eylem yapanı değil, sonucu vurgular.\n   - Over 500 articles were analyzed. (500'den fazla makale analiz edildi.)\n\nYDS'de passive voice soruları, hem gramer bölümünde hem de okuma parçalarında sıkça görülür."
        },
        {
          "heading": "Passive Voice Yapısı ve Oluşturma",
          "content": "**Temel Yapı**: Subject + be (çekimli) + V3 (past participle) + (by + agent)\n\n**Active'den Passive'e Dönüştürme Adımları**:\n\n1. **Active'deki nesneyi özne yapın**:\n   Active: Researchers (S) conducted (V) the study (O).\n   Passive: The study... (yeni özne)\n\n2. **'Be' fiilini doğru zamanda çekimleyin**:\n   Active: conducted (Simple Past)\n   Passive: was/were (Past tense of 'be')\n\n3. **Ana fiili V3 haline getirin**:\n   conducted → conducted (zaten V3)\n\n4. **Eski özneyi 'by + agent' olarak ekleyin (opsiyonel)**:\n   Passive: The study was conducted by researchers.\n\n**Tam Dönüşüm**:\nActive: Researchers conducted the study in 2023.\nPassive: The study was conducted (by researchers) in 2023.\n\n**'By + agent' Ne Zaman Atılır?**\n- Özne belirsizse: The book was published in 1859. (Kim tarafından önemli değil)\n- Özne açıksa: The experiment was repeated several times. (Herhangi biri tarafından)\n- Özne 'people', 'they', 'someone' gibi genel ifadelerle: English is spoken worldwide."
        },
        {
          "heading": "Passive Voice - Tüm Zamanlar",
          "content": "**Simple Present Passive**\nYapı: am/is/are + V3\n✅ Data is collected regularly. (Veri düzenli olarak toplanır.)\n✅ Experiments are conducted in laboratories. (Deneyler laboratuvarlarda yapılır.)\n\n**Simple Past Passive**\nYapı: was/were + V3\n✅ The hypothesis was tested in multiple studies. (Hipotez birçok çalışmada test edildi.)\n✅ Significant differences were observed. (Önemli farklar gözlemlendi.)\n\n**Present Perfect Passive**\nYapı: has/have been + V3\n✅ The results have been published. (Sonuçlar yayımlandı.)\n✅ Several theories have been proposed. (Birkaç teori öne sürüldü.)\n\n**Past Perfect Passive**\nYapı: had been + V3\n✅ The data had been analyzed before the meeting. (Veri toplantıdan önce analiz edilmişti.)\n✅ The method had been used in previous research. (Yöntem önceki araştırmalarda kullanılmıştı.)\n\n**Future Passive (will)**\nYapı: will be + V3\n✅ Further research will be conducted. (İleri araştırma yapılacak.)\n✅ The findings will be presented at the conference. (Bulgular konferansta sunulacak.)\n\n**Future Passive (going to)**\nYapı: am/is/are + going to be + V3\n✅ The study is going to be replicated. (Çalışma tekrarlanacak.)\n\n**Present Continuous Passive**\nYapı: am/is/are + being + V3\n✅ The data is being analyzed. (Veri analiz ediliyor.)\n✅ New methods are being developed. (Yeni yöntemler geliştirilıyor.)\n\n**Past Continuous Passive**\nYapı: was/were + being + V3\n✅ The experiment was being conducted when the error occurred. (Hata oluştuğunda deney yapılıyordu.)\n\n**Modal Passive**\nYapı: modal + be + V3\n✅ The results can be verified. (Sonuçlar doğrulanabilir.)\n✅ The theory should be tested. (Teori test edilmeli.)\n✅ The study must be replicated. (Çalışma tekrarlanmalı.)\n✅ The hypothesis may be confirmed. (Hipotez doğrulanabilir.)"
        },
        {
          "heading": "Passive with Modals ve Özel Yapılar",
          "content": "**Modal + Passive (Present)**\nYapı: modal + be + V3\n\n✅ This method can be applied to other fields. (Bu yöntem diğer alanlara uygulanabilir.)\n✅ The results should be interpreted cautiously. (Sonuçlar dikkatle yorumlanmalı.)\n✅ Further studies must be conducted. (İleri çalışmalar yapılmalı.)\n✅ The findings may be questioned. (Bulgular sorgulanabilir.)\n✅ The data could be analyzed differently. (Veri farklı analiz edilebilir.)\n\n**Modal + Passive (Perfect)**\nYapı: modal + have been + V3\n\n✅ The error should have been detected earlier. (Hata daha erken tespit edilmeliydi.)\n✅ More participants could have been included. (Daha fazla katılımcı dahil edilebilirdi.)\n✅ The study might have been influenced by bias. (Çalışma önyargıdan etkilenmiş olabilir.)\n\n**Passive Infinitive**\nYapı: to be + V3\n\n✅ The hypothesis needs to be tested. (Hipotezin test edilmesi gerekiyor.)\n✅ The findings are expected to be published soon. (Bulguların yakında yayımlanması bekleniyor.)\n✅ The method appears to be effective. (Yöntem etkili görünüyor.)\n\n**Passive Gerund**\nYapı: being + V3\n\n✅ The data enjoys being analyzed thoroughly. (Veri detaylı analiz edilmekten hoşlanır.) [Nadir]\n✅ Researchers fear being criticized. (Araştırmacılar eleştirilmekten korkar.)\n\n**Get-Passive (Informal)**\nYapı: get + V3\n\n✅ The paper got rejected. (Makale reddedildi.) [Informal]\n✅ The study got published. (Çalışma yayımlandı.) [Daha az formal]\n\n**Not**: YDS'de 'be' passive daha yaygındır, 'get' passive konuşma dilinde daha sıktır."
        },
        {
          "heading": "By Agent vs. Diğer Prepositions",
          "content": "**'By' - Eylemi Yapan Kişi/Şey**\n✅ The theory was proposed by Darwin. (Teori Darwin tarafından öne sürüldü.)\n✅ The study was conducted by researchers at MIT. (Çalışma MIT'deki araştırmacılar tarafından yapıldı.)\n\n**'With' - Kullanılan Araç/Yöntem**\n✅ The data was collected with a questionnaire. (Veri bir anketle toplandı.)\n✅ The experiment was performed with advanced equipment. (Deney ileri ekipmanla yapıldı.)\n\n**'In' - Zaman/Yer**\n✅ The research was published in 2020. (Araştırma 2020'de yayımlandı.)\n✅ The study was conducted in a controlled environment. (Çalışma kontrollü ortamda yapıldı.)\n\n**'From' - Kaynak/Köken**\n✅ The samples were obtained from participants. (Örnekler katılımcılardan elde edildi.)\n✅ The data was derived from multiple sources. (Veri birçok kaynaktan türetildi.)\n\n**'To' - Alıcı/Hedef**\n✅ The findings were presented to the committee. (Bulgular komiteye sunuldu.)\n✅ The results were sent to peer reviewers. (Sonuçlar hakem değerlendiricilerine gönderildi.)\n\n**YDS'de Sık Hata**:\n❌ The study was conducted with researchers. (Çalışma araştırmacılarla yapıldı.)\n✅ The study was conducted by researchers. (Çalışma araştırmacılar tarafından yapıldı.)\n\n❌ The data was analyzed by statistical software. (Veri istatistik yazılımı tarafından analiz edildi.)\n✅ The data was analyzed with statistical software. (Veri istatistik yazılımıyla analiz edildi.)"
        },
        {
          "heading": "Double Object Passives",
          "content": "Bazı fiiller iki nesne alır (indirect + direct object). Bu durumda iki farklı passive yapısı mümkündür.\n\n**Active**: Researchers gave participants questionnaires.\n(Araştırmacılar katılımcılara anketler verdi.)\n\n**Passive 1 (Indirect object → Subject)**:\n✅ Participants were given questionnaires. (Katılımcılara anketler verildi.)\n[Daha yaygın ve doğal]\n\n**Passive 2 (Direct object → Subject)**:\n✅ Questionnaires were given to participants. (Anketler katılımcılara verildi.)\n[Daha az yaygın, 'to' gerekli]\n\n**Diğer Örnekler**:\n\n**Tell**:\nActive: They told students the results.\nPassive 1: Students were told the results. (Öğrencilere sonuçlar söylendi.) ✅ Yaygın\nPassive 2: The results were told to students. (Sonuçlar öğrencilere söylendi.) ❌ Kulağa yanlış\n\n**Show**:\nActive: Researchers showed participants the data.\nPassive 1: Participants were shown the data. (Katılımcılara veri gösterildi.) ✅\nPassive 2: The data was shown to participants. (Veri katılımcılara gösterildi.) ✅\n\n**Send**:\nActive: We sent reviewers the manuscript.\nPassive 1: Reviewers were sent the manuscript. (Hakemlere el yazması gönderildi.) ✅\nPassive 2: The manuscript was sent to reviewers. (El yazması hakemlere gönderildi.) ✅\n\n**YDS İpucu**: Kişi (indirect object) genellikle daha doğal bir pasif özne yapar."
        },
        {
          "heading": "Yaygın Hatalar ve Çözümler",
          "content": "**1. 'Be' Fiili Unutulması**\n❌ The study conducted in 2020. (Çalışma 2020'de yapıldı.)\n✅ The study was conducted in 2020. (Passive'de 'be' fiili şart!)\n\n**2. V2 yerine V3 Kullanımı**\n❌ The data was collected carefully. ✅ (collect→collected düzenli)\n❌ The results was wrote clearly. (Sonuçlar açıkça yazıldı.)\n✅ The results were written clearly. (write→wrote→written düzensiz)\n\n**3. Özne-Fiil Uyumsuzluğu**\n❌ The results was analyzed. (Sonuçlar analiz edildi.)\n✅ The results were analyzed. (Plural özne → 'were')\n❌ Data are collected. (Veri toplanır.)\n✅ Data is collected. (YDS'de 'data' genellikle tekil) VEYA\n✅ Data are collected. (İngiliz İngilizcesi'nde çoğul kabul edilir)\n\n**4. Active ve Passive Karışımı**\n❌ The experiment conducted by researchers showed results. (Deney yapıldı araştırmacılar tarafından sonuçlar gösterdi.)\n✅ The experiment conducted by researchers showed results. ❌ 'conducted' burada participle, passive değil\n✅ The experiment was conducted by researchers and showed results. ✅\n\n**5. Gereksiz Passive Kullanımı**\n❌ Mistakes were made by us. (Hatalar bizim tarafımızdan yapıldı.)\n✅ We made mistakes. (Biz hata yaptık.) [Active daha doğal]\n\n**6. 'By' Preposition Hatası**\n❌ The data was collected with researchers. (Veri araştırmacılarla toplandı.)\n✅ The data was collected by researchers. (Veri araştırmacılar tarafından toplandı.)\n\n**7. Get-Passive'in Akademik Metinde Kullanımı**\n❌ The study got published in a prestigious journal. (Çalışma prestijli dergide yayımlandı.)\n✅ The study was published in a prestigious journal. (Akademik yazımda 'be' tercih edilir)"
        },
        {
          "heading": "YDS Stratejileri ve Pratik Önerileri",
          "content": "**Sınav Stratejileri**:\n\n1. **Passive Tanıma**:\n   - 'be' + V3 yapısını arayın\n   - 'by' kelimesi passive işareti olabilir (ama her zaman değil)\n   - Özne eylem alan mı, yapan mı? Alan → Passive\n\n2. **Zaman Belirleme**:\n   - 'be' fiilinin zamanına bakın:\n     - is/are → Present\n     - was/were → Past\n     - has/have been → Present Perfect\n     - will be → Future\n\n3. **Active vs. Passive Seçimi**:\n   - Yapan önemliyse → Active\n   - Yapılan önemliyse → Passive\n   - Akademik metin → Genellikle Passive\n\n4. **By-Agent Gerekliliği**:\n   - Özne açıksa → atla\n   - Özne önemliyse → ekle\n   - YDS'de genellikle gereksizdir\n\n5. **V3 (Past Participle) Bilgisi**:\n   - Düzenli: Verb + ed (analyze → analyzed)\n   - Düzensiz: Ezberlemek gerekir (write → written, take → taken)\n\n**Pratik Önerileri**:\n\n1. **Düzensiz Fiilleri Ezberleyin**: YDS'de sık kullanılan 100 düzensiz fiilin V3 halini öğrenin.\n\n2. **Akademik Makalelerin Methods Bölümünü Okuyun**: Passive voice'un yoğun kullanıldığı bölüm.\n\n3. **Active → Passive Dönüştürme Egzersizi**: 50 active cümle alın, passive'e çevirin.\n\n4. **Passive → Active Dönüştürme**: Tersi yönde de pratik yapın.\n\n5. **Boşluk Doldurma**: YDS tipi metinlerde passive yapıları tamamlayın.\n\n6. **Hata Bulma**: Passive cümlelerdeki hataları bulup düzeltin.\n\n7. **Cümle Yazma**: Her passive zaman için 5 akademik cümle yazın.\n\n**YDS'de Passive ile İlgili Soru Tipleri**:\n\n1. **Boşluk Doldurma**: 'The data _____ (collect) last year.' → was collected\n\n2. **Dönüştürme**: 'Researchers analyzed the results.' → 'The results were analyzed (by researchers).'\n\n3. **Hata Bulma**: Passive yapıda yanlış olan cümleyi bulma.\n\n4. **Anlam Eşdeğerliği**: Active cümlenin passive karşılığını seçme.\n\n5. **Cümle Tamamlama**: Uygun passive yapıyı seçerek cümleyi tamamlama."
        }
      ]
    }
  ]
}
